#+TITLE: Endpoints=>Json
#+PROPERTY: header-args:sql-mode :product postgres :noweb yes :comments off

** All keys mapped
   We should have these keys:
   - release
   - release_date
   - spec
   - source
   - endpoints
   - tests

 #+begin_src shell :dir ../resources/coverage
 cat 1.19.0.json | jq '. | keys'
 #+end_src

 #+RESULTS:
 #+begin_example
 [
   "endpoints",
   "release",
   "release_date",
   "source",
   "spec",
   "tests"
 ]
 #+end_example

** All endpoints, and no extra, mapped correctly
   In the latest open_api spec there are 820 non-deprecated endpoints
   Our json grabs all of these and makes an array.  That array should have a length of 820

   #+begin_src shell
   cat 1.19.0.json | jq '.endpoints | length'
   #+end_src

   #+RESULTS:
   #+begin_example
   820
   #+end_example

   Each endpoint includes its level.  Going from current results on apisnoop.cncf.io,
   there should be
   - 476 stable endpoints
   - 247 beta
   - 97 alpha

   #+begin_src shell
     echo "stable: "$(cat 1.19.0.json | jq '.endpoints | map(select(.level | contains("stable"))) | length')
     echo "beta: "$(cat 1.19.0.json | jq '.endpoints | map(select(.level | contains("beta"))) | length')
     echo "alpha: "$(cat 1.19.0.json | jq '.endpoints | map(select(.level | contains("alpha"))) | length')
   #+end_src

   #+RESULTS:
   #+begin_example
   stable: 476
   beta: 247
   alpha: 97
   #+end_example

** tested
  For conf_tested stable endpoints, there should be:
  - 19: 180
  - 18: 140
  - 17: 131
  - 16: 118
  - 15: 86
     #+begin_src shell
       echo "19: "$(cat 1.19.0.json | jq '.endpoints
       | map(select(.level | contains("stable")))
       | map(select(.conf_tested == true))
       | length')
       echo "18: "$(cat 1.18.0.json | jq '.endpoints
       | map(select(.level | contains("stable")))
       | map(select(.conf_tested == true))
       | length')
       echo "17: "$(cat 1.17.0.json | jq '.endpoints
       | map(select(.level | contains("stable")))
       | map(select(.conf_tested == true))
       | length')
       echo "16: "$(cat 1.16.0.json | jq '.endpoints
       | map(select(.level | contains("stable")))
       | map(select(.conf_tested == true))
       | length')
       echo "15: "$(cat 1.15.0.json | jq '.endpoints
       | map(select(.level | contains("stable")))
       | map(select(.conf_tested == true))
       | length')
     #+end_src

     #+RESULTS:
     #+begin_example
     19: 180
     18: 140
     17: 131
     16: 118
     15: 86
     #+end_example

     Sweet, this feels good!
